lab_1/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lab_1/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lab_1/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте Процедура ТоварыКоличествоПриИзменении(Элемент)  СтрокаТабличнойЧасти = Элементы.ПоступлениеТоваров.ТекущиеДанные;  СерверныеПроцедуры.АвтоСумма(СтрокаТабличнойЧасти); КонецПроцедуры   &НаКлиенте Процедура ТоварыЦеныПриИзменении(Элемент)  СтрокаТабличнойЧасти = Элементы.ПоступлениеТоваров.ТекущиеДанные;  СерверныеПроцедуры.АвтоСумма(СтрокаТабличнойЧасти); КонецПроцедуры  &НаКлиенте Процедура ТоварыТоварПриИзменении(Элемент)  СтрокаРасчета = Элемент.ПоступлениеТоваров.ТекущиеДанные;  СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Товар);  ТоварыТоварПриИзменении(Элемент); КонецПроцедуры        &НаСервере 
Функция ПолучитьЦену(ТоварДокумента) 
 СтруктураОтбора = Новый Структура; 
 СтруктураОтбора.Вставить("Товар" , ТоварДокумента); 
 РезультатОтбора = РегистрыСведений.ЦеныНоменклатуры.Получить(СтруктураОтбора); 
 Возврат РезультатОтбора.Цена; 
КонецФункции
